In [33]:
import pandas as pd
df = pd.read_excel("score.xlsx")
df

  지원번호   이름   학교    키   국어   영어   수학  사회        SW특기
0   1번  강나래  구로고  197   90   85  100  85      Python
1   2번  강태원  구로고  184   40   35   50  25        Java
2   3번  강호림  가산고  168   80   75   70  75  Javascript
3   4번  김수찬  구로고  187   40   60   70  80         NaN
4   5번  김재욱  가산고  188   15   20   10  10         NaN
5   6번  박동현  가산고  202   80  100   95  80           C
6   7번  박혜정  구로고  188   55   65   45  35      PYTHON
7   8번  승근열  구로고  190  100   85   90  95          C#

In [5]:
# df['이름']
# df[['이름','학교','키']]
# df[['키','이름','SW특기']]

df = pd.read_excel('score.xlsx',index_col = '이름')
df

      학교    키   국어   영어   수학  사회        SW특기
이름
강나래  구로고  197   90   85  100  85      Python
강태원  구로고  184   40   35   50  25        Java
강호림  가산고  168   80   75   70  75  Javascript
김수찬  구로고  187   40   60   70  80
김재욱  가산고  188   15   20   10  10
박동현  가산고  202   80  100   95  80           C
박혜정  구로고  188   55   65   45  35      Python
승근열  구로고  190  100   85   90  95          C#

In [9]:
df = pd.read_excel('score.xlsx')
df
df.describe()
df['국어'].describe()
df['이름'].describe()

count       8
unique      8
top       강나래
freq        1
Name: 이름, dtype: object

In [10]:
df.describe() # 숫자에 해당되는 것만 출력됨

                키          국어          영어          수학         사회
count    8.000000    8.000000    8.000000    8.000000   8.000000
mean   188.000000   62.500000   65.625000   66.250000  60.625000
std      9.985704   29.519969   26.917533   30.325614  32.120032
min    168.000000   15.000000   20.000000   10.000000  10.000000
25%    186.250000   40.000000   53.750000   48.750000  32.500000
50%    188.000000   67.500000   70.000000   70.000000  77.500000
75%    191.750000   82.500000   85.000000   91.250000  81.250000
max    202.000000  100.000000  100.000000  100.000000  95.000000

In [11]:
df.head()

    이름   학교    키  국어  영어   수학  사회        SW특기
0  강나래  구로고  197  90  85  100  85      Python
1  강태원  구로고  184  40  35   50  25        Java
2  강호림  가산고  168  80  75   70  75  Javascript
3  김수찬  구로고  187  40  60   70  80
4  김재욱  가산고  188  15  20   10  10

In [12]:
df.tail()

    이름   학교    키   국어   영어  수학  사회    SW특기
3  김수찬  구로고  187   40   60  70  80
4  김재욱  가산고  188   15   20  10  10
5  박동현  가산고  202   80  100  95  80       C
6  박혜정  구로고  188   55   65  45  35  Python
7  승근열  구로고  190  100   85  90  95      C#

In [15]:
df.values

array([['강나래', '구로고', 197, 90, 85, 100, 85, 'Python'],
       ['강태원', '구로고', 184, 40, 35, 50, 25, 'Java'],
       ['강호림', '가산고', 168, 80, 75, 70, 75, 'Javascript'],
       ['김수찬', '구로고', 187, 40, 60, 70, 80, ' '],
       ['김재욱', '가산고', 188, 15, 20, 10, 10, ' '],
       ['박동현', '가산고', 202, 80, 100, 95, 80, 'C'],
       ['박혜정', '구로고', 188, 55, 65, 45, 35, 'Python'],
       ['승근열', '구로고', 190, 100, 85, 90, 95, 'C#']], dtype=object)

In [16]:
df.shape

(8, 8)

In [18]:
df.columns

Index(['이름', '학교', '키', '국어', '영어', '수학', '사회', 'SW특기'], dtype='object')

In [19]:
df['이름']

0    강나래
1    강태원
2    강호림
3    김수찬
4    김재욱
5    박동현
6    박혜정
7    승근열
Name: 이름, dtype: object

In [21]:
df.columns[:-1]

Index(['이름', '학교', '키', '국어', '영어', '수학', '사회'], dtype='object')

In [31]:
df[df.columns[0]]
# df[0] # df[번호로는 검색이 안됨]
# df.info()
df['키'].max()
df['키'].min()
df['키'].mean()
df['키'].nlargest()
df['키'].nsmallest()
df['학교'].unique()
df['학교'].nunique()
df['SW특기'].count()
df['학교'].count()
df['국어'].sum()

AttributeError: 'Series' object has no attribute 'nuique'

In [32]:
df.columns
df.columns[[0,3,-1]]

Index(['이름', '국어', 'SW특기'], dtype='object')

In [ ]:
df[['이름','국어']]